Artillery/test.yml
config:
    target: "https://postman-echo.com/"
    phases:
        - duration: 3
          arrivalRate: 5
          rampUp: 10
          name: Artillery Test 1.0
    payload:
        - path: "keywords.csv"
          fields:
              - "name"
              - "text"
          skipHeader: true
          skipEmptyLines: true
    plugins:
        ensure:
            thresholds:
                - http.response_time.pb95: "15"
                - http.response_time.max: "2000"

            conditions:
                - expression: vusers.failed == 0

scenarios:
    - name: ECHO
      flow:
          - get:
                url: "{{ target }}get"
          - post:
                name: "Test"
                url: "{{ target }}post"
                json:
                    foo1: "bar1"
                    foo2: "bar2"